from datetime import datetime
from services.api_service import send_message
from keyboards.user_keyboards import join_keyboard, main_keyboard, rules_keyboard
from services.membership_service import is_member
from services.storage_service import save_user_info, get_main_admins, get_support_admins
from db import user_states


def handle_start(chat_id, user_id):
    # ذخیره اطلاعات اولیه کاربر
    save_user_info(user_id, {
        "started_bot": True,
        "chat_id": chat_id
    })

    # اطلاع به همه ادمین‌ها
    for admin_id in get_main_admins() + get_support_admins():
        try:
            send_message(
                admin_id,
                f"""
👤 کاربر جدید ربات را استارت کرد

🆔 آیدی عددی: {user_id}
📅 زمان: {datetime.now().strftime('%Y-%m-%d %H:%M:%S')}
"""
            )
        except:
            pass

    if not is_member(user_id):
        send_message(
            chat_id,
            "📢 برای استفاده از ربات ابتدا عضو کانال شوید.",
            join_keyboard()
        )
        return

    state = user_states.get(user_id, {})

    if not state.get("rules"):
        send_message(
            chat_id,
            """📜 قوانین و مقررات «فوتبال‌تایمز | 𝙁𝙤𝙤𝙩𝙗𝙖𝙡𝙡 𝙏𝙞𝙢𝙚𝙨»

لطفاً پیش از هرگونه ثبت درخواست یا پرداخت، موارد زیر را با دقت مطالعه فرمایید. ثبت درخواست به منزله پذیرش کامل این قوانین است.

*۱. رعایت ادب و احترام*
رعایت شئونات اخلاقی و احترام در تمامی پیام‌ها الزامی است. در صورت مشاهده هرگونه بی‌احترامی، همکاری فوراً متوقف خواهد شد.

*۲. مسئولیت محتوای ارسالی*
مسئولیت کامل محتوای ارسالی (متن، تصویر، لینک، بنر و …) بر عهده ارسال‌کننده است. در صورت وجود هرگونه تخلف قانونی یا محتوای نامناسب، مسئولیت حقوقی آن متوجه کاربر خواهد بود.

*۳. عدم استرداد وجه*
وجوه پرداخت‌شده تحت هیچ شرایطی قابل عودت نمی‌باشد.

*۴. پرداخت ناقص*  
در صورت واریز مبلغ کمتر از تعرفه تعیین‌شده — حتی به میزان ۱ ریال — وجه پرداختی بازگردانده نخواهد شد و کاربر موظف است مابه‌التفاوت را به طور کامل پرداخت نماید.

*۵. ثبت نهایی پس از پرداخت کامل * 
ارائه خدمات صرفاً پس از تأیید پرداخت کامل و نهایی انجام خواهد شد.

*۶. حق بررسی و رد درخواست*
مدیریت «فوتبال‌تایمز» حق بررسی، تأیید یا رد هرگونه درخواست را بدون الزام به ارائه توضیح محفوظ می‌دارد.

*۷. تغییر قوانین*
در صورت لزوم، قوانین و شرایط ممکن است به‌روزرسانی شوند و نسخه جدید از زمان انتشار لازم‌الاجرا خواهد بود.


*۸. فیش جعلی*

در صورت ارسال هرگونه فیشه جعلی، پشتیبانان قادر به انجام اقدام قضایی خواهند بود. شما با پذیرفتن این قوانین این قانون مهم را می پذیرید.

*با ثبت درخواست و استفاده از خدمات، شما تأیید می‌کنید که تمامی موارد فوق را مطالعه کرده و می‌پذیرید.*

*با احترام مدیریت «فوتبال‌تایمز | 𝙁𝙤𝙤𝙩𝙗𝙖𝙡𝙡 𝙏𝙞𝙢𝙚𝙨»*""",
            rules_keyboard()
        )
        return

    send_message(
        chat_id,
        "⚽ به فوتبال تایمز خوش آمدید!\n\nاز منوی زیر استفاده کنید:",
        main_keyboard()
    )